Revit 2027 API
CoordinationModelLinkData.ModelName Property
 The name of the model defining this Coordination Model link.
 For a Coordination Model from Autodesk Docs, ModelName is the name of the model where the 3D view defining this Coordination Model is found.
 For a local Coordination Model, ModelName is the name of the local .nwc or .nwd file.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ModelName { get; }
Public ReadOnly Property ModelName As String
	Get
public:
property String^ ModelName {
	String^ get ();
}
member ModelName : string with get
Property Value
String
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace